# Append Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
DoubleArray..::..Append Method
DoubleArray Class See Also
---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual void Append(
	ref double item
)
```

Visual Basic
---
```text
Public Overridable Sub Append ( _
	ByRef item As Double _
)
```

Visual C++
---
```text
public:
virtual void Append(
	double% item
)
```

# ### Parameters
item
    Type: System..::..Double%
# See Also
DoubleArray Class
Autodesk.Revit.DB Namespace